#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Bunsen Labs Desktop Installaton Notes
#+STARTUP: showall
#+LANGUAGE: en
#+OPTIONS: toc:nil h:4 html-postamble:nil html-preamble:t tex:t f:t d:nil
#+OPTIONS: prop:("VERSION")
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="./css/style.css" rel="stylesheet" type="text/css" />

#+LINK: gh    https://github.com/
#+LINK: rfc   https://tools.ietf.org/html/
#+LINK: wiki  https://en.wikipedia.org/wiki/


#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 4


  :PROPERTIES:
  :Name: /home/deerpig/org/bunsen-install.org
  :Created: 2016-06-13T12:52@Wat Phnom (11.5733N17-104.925295W)
  :ID: 238cc479-376a-4040-9e06-750faf722dc7
  :URL:
  :END:

* Status of This Document

#+HTML: <span>The lastest version of this document is: <em>
#+BEGIN_SRC sh :exports results :results value html
git describe --abbrev=0 --tags
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
v00.01
#+END_EXPORT
#+HTML: </em></span>

This section describes the status of this document at the
time of its publication. Other documents *may supersede*
this document.

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.03"
  RES=`git log $TAG...HEAD --pretty="<li>%s</li>\n" -- bunsen-install.org`
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>

